import React from "react";

export default function Page() {
    return (
        <main className="flex flex-col items-center justify-center gap-4 p-4 sm:p-8 md:p-12">
            <section id="ch1" className="text-center py-12">
                <p className="text-lg">Перед тим як занурюватися в низькорівневі принципи роботи протоколів,
                    варто познайомитися з «гравцями» на полі. Ця сторінка — погляд на архітектуру LockedNet із
                    висоти пташиного польоту. Ми розглянемо загальну картину мережі без лупи та паяльника, щоб
                    зрозуміти, хто кому і як передає дані.</p>
            </section>

            <section id="ch2" className="text-center py-12">
                <h2 className="text-4xl font-bold text-center">Мозок операцій: Головний Хаб</h2>
                <p className="text-lg">Першим ділом справедливо буде почати з Хаба — це одночасно і центральний
                    процесор, і головний ретранслятор екосистеми.</p>
                <p className="text-lg">Він приймає пакети даних та команди від користувача, фільтрує їх і приймає
                    рішення, куди направляти запити далі. Окрім маршрутизації, Хаб здатен виконувати власні внутрішні
                    команди (більш розробницькі та інформаційні, ніж виконавчі). Пристрій обладнаний дисплеєм для
                    виведення актуального стану в реальному часі: заряду батареї, статусу підключення та системних
                    сповіщень. Усі дії в мережі Хаб скрупульозно записує у власну систему логування.</p>
            </section>

            <section id="ch3" className="text-center py-12">
                <h2 className="text-4xl font-bold text-center">Точки входу: Як керувати системою</h2>
                <p className="text-lg">Повноцінний інтерфейс для взаємодії з LockedNet знаходиться прямо на веб-ресурсі, адаптованому для зручного використання зі смартфона. Цей сайт не висить у відкритому інтернеті — він локально піднімається по протоколу HTTP навколо приймаючих пристроїв. Таким чином, смартфон стає першою ланкою в логічному ланцюгу управління екосистемою.</p>
                <p className="text-lg">Оскільки смартфон і Хаб фізично "розмовляють" різними мовами (піднімати HTTP-сервер прямо на мікроконтролері Хаба — це самогубство для акумулятора), між ними стоять приймаючі пристрої (ретранслятори). Їх в екосистемі два:</p>
                <ul className="list-disc list-inside text-lg">
                    <li>Локальний ПК: Основний міст у мирний час. На комп'ютері працює Python-сервер, який спілкується зі смартфоном через домашню Wi-Fi мережу, а дані на Хаб передає дротом через COM-порт. ПК також бере на себе частину логування. Але щойно ПК вимикається через довготривалі вимкнення, ця ланка падає.</li>
                    <li>Help-Брелок (Beacon): Рятівний круг поза межами домашнього Wi-Fi або під час блекауту. Цей компактний пристрій самостійно піднімає власну Wi-Fi точку доступу (Access Point), до якої підключається смартфон. Отримавши HTTP-запит, брелок миттєво транслює його на Хаб через власні радіоканали.</li>
                </ul>
            </section>

            <section id="ch4" className="text-center py-12">
                <h2 className="text-4xl font-bold text-center">Виконавчі модулі: Домашні девайси</h2>
                <p className="text-lg">Домашні девайси — це кінцеві пристрої, що безпосередньо маніпулюють середовищем або збирають дані. Вони працюють у жорсткому фоновому режимі: перебувають у глибокому сні, зберігаючи дорогоцінну енергію акумуляторів, і періодично «слухають» радіоефір Хаба, чекаючи на свої доручення. Кожен девайс має власний унікальний функціонал, оптимізований під конкретну задачу.</p>
                <p className="text-lg">Перша версія LockedNet (MVP) розроблена з пріоритетом на вирішення базових потреб комфорту звичайних людей під час блекаутів.</p>
            </section>

            <section id="ch5" className="text-center py-12">
                <h2 className="text-4xl font-bold text-center">Аналітичні модулі (Сенсори):</h2>
                <ul className="list-disc list-inside text-lg">
                    <li>UPSdevice: Головний вартовий системи. Цей пристрій постійно підключений до розетки і вимірює напругу в мережі 220В. Саме він лежить в основі концепції "антиблекаут". Щойно напруга зникає, він сигналізує Хабу, який миттєво запускає сценарії порятунку.
</li>
                    <li>meteoDevice: Аналізатор мікроклімату. Відстежує температуру, вологість та рівень вуглекислого газу (CO2) у приміщенні. Ці дані виводяться на екран смартфона і паралельно аналізуються Хабом для роботи протоколу.</li>
                </ul>
            </section>

            <section id="ch6" className="text-center py-12">
                <h2 className="text-4xl font-bold text-center">Модулі дії (Маніпулятори середовищем):</h2>
                <ul className="list-disc list-inside text-lg">
                    <li>alarmLight: Система адаптивного освітлення, реалізована на базі адресної світлодіодної стрічки («дуже розумна гірлянда»). Має безліч режимів світіння та миготіння. Керується фізичною кнопкою, через веб-інтерфейс, або автоматично вмикається під час спрацювання протоколу AntiBlackout.</li>
                    <li>comfortAir: Кліматичний комбайн «3-в-1». Девайс, що підтримує ідеальний мікроклімат у Тривожній кімнатці. Об'єднує в одному компактному корпусі системи нагрівання, зволоження та вентиляції повітря. Вміє виконувати точкові команди користувача (наприклад: "нагріти до 20°C, зволожити до 45%"), а також працює як штатна одиниця під час блекаутів.</li>
                    <li>boilDevice: Приємна примха поза основним функціоналом виживання. Це механічний маніпулятор (сервопривід), який за командою фізично натискає кнопку на електричному чайнику і повертається у вихідне положення. Не бере участі в протоколах безпеки, але гарантує, що гаряча кава буде чекати на мене по поверненню додому.</li>
                </ul>
            </section>

            <section id="ch7" className="text-center py-12">
                <h2 className="text-4xl font-bold text-center"></h2>
                <p className="text-lg"></p>
            </section>

        </main>
    );
}