import React from "react";

export default function Page() {
  return (
    <main className="flex flex-col items-center justify-center gap-4 p-4 sm:p-8 md:p-12">
          
      <section id="main" className="text-center py-12">
        <h1 className="text-5xl font-bold text-center">
          AntiBlackout system<br />LockedNet
        </h1>
      </section>

      <section id="blackouts" className="flex flex-col items-center justify-center gap-4 max-w-4xl mx-auto text-center py-12">
              <h2 className="text-4xl font-bold">Темрява, що стала рутиною</h2>
        <p className="text-lg">Енергетична інфраструктура України регулярно зазнає критичних руйнувань,
          перетворюючи тривалі відключення світла на щоденне випробування. Блекаут — це більше, ніж просто
          відсутність освітлення. Це паралізовані системи опалення під час зимових морозів, нестерпна задуха й
          зупинка водопостачання влітку, кілометрові черги знеструмленого електротранспорту, обірвані мережі
          комунікації, порушення базових потреб сучасної людини. У таких екстремальних умовах повна залежність
          від централізованої мережі та інтернет-провайдерів стає не просто незручністю, а критичною вразливістю.</p>
      </section>
          
      <section id="baseinfo" className="flex flex-col items-center justify-center gap-4 max-w-4xl mx-auto text-center py-12">
        <p className="text-lg">LockedNet — це децентралізована антиблекаут екосистема, створена для абсолютної
          незалежності від зовнішніх мереж. Серце системи, Головний Хаб, використовує власні радіоканали для
          координації мережі автономних пристроїв, відсікаючи потребу у Wi-Fi роутерах.</p>
        <p className="text-lg">Поточний MVP спроєктований для подолання жорстких кліматичних викликів під час блекауту. У зимовий період автономні виконавчі
            модулі підтримають критичну температуру в приміщенні, а влітку — забезпечать вентиляцію та зволоження
            повітря. Завдяки протоколу AntiBlackout, екосистема миттєво реагує на зникнення напруги, розгортаючи
            адаптивне освітлення та переводячи розумні пристрої у режим автономної роботи.</p>
      </section>

      <section id="advices" className="flex flex-col items-center justify-center gap-4 max-w-4xl mx-auto text-center py-12">
        <h2 className="text-4xl font-bold">Стратегія тривожної кімнатки.</h2>
        <p className="text-lg">Головне правило виживання під час зимових блекаутів — не намагатися обігріти всю площу квартири.
          Найефективніша стратегія полягає в ізоляції однієї, найменшої кімнати, яка перетворюється на автономну
          «капсулу». Саме під цю логіку оптимізовано роботу виконавчих модулів LockedNet. Замість марного розсіювання
          дорогоцінної енергії акумуляторів на всю квартиру, система фокусує ресурси на підтримці критичного
          мікроклімату в цьому обмеженому 3×3 м² просторі.</p>
      </section>

      <section id="nextPage" className="flex flex-col items-center justify-center gap-4 max-w-4xl mx-auto text-center py-12">
        <p className="text-lg">Цей веб-ресурс створено з єдиною метою — перетворити десятки сторінок розрізнених технічних нотаток та
          схем на зрозумілу, структуровану презентацію. Тут немає складної академічної документації, лише жива логіка
          роботи екосистеми, викладена людською мовою.</p>
        <p className="text-lg">Навігація тут нелінійна і працює за принципом «павутини»: ви можете вільно стрибати між будь-якими
          розділами через розгортальну бічну панель. Але для тих, хто хоче розібратися в архітектурі LockedNet
          максимально комфортно, у тій же панелі ми передбачили «дорожню карту» — спеціально прокладений маршрут
          сторінок для легкого та послідовного занурення в проєкт</p>
        <a href="/archnet" className="text-blue-600 hover:text-blue-800 dark:text-blue-400 dark:hover:text-blue-600 transition-colors font-semibold">
          Перейти до архітектури LockedNet
        </a>
      </section>
          
    </main>
  );
}
